from langchain_core.prompts import ChatPromptTemplate
from langserve import RemoteRunnable


categorizer = RemoteRunnable("http://localhost:8000/summarizer/")

compliant = '''
"ยุทธพงศ์" แฉ "ทร." ตั้งงบซื้อยูเอวี แพงเกินราคาพันล้าน ส่อไม่โปร่งใส นายยุทธพงศ์ จรัสเสถียร ส.ส.มหาสารคาม พรรคเพื่อไทย อภิปรายต่อที่ประชุม วาระพิจารณาร่างพระราชบัญญัติ (พ.ร.บ.) งบประมาณรายจ่ายประจำปีงบประมาณ พ.ศ.2566 วงเงิน 3.185 ล้านล้านบาท วาระแรก เป็นวันสาม โดยเปิดประเด็นกับกระทรวงการคลังต่อการเปิดประมูลโครงการท่อส่งน้ำในเขตพัฒนาเศรษฐกิจพิเศษ (อีอีซี) ซึ่งย้ำถึงการเปิดประมูลที่ส่อว่าไม่โปร่งใส ขัดต่อการประกาศวิสัยทัศน์ของหน่วยงาน ทั้งนี้ในกลางเดือนกรกฎหาคม หากพล.อ.ประยุทธ์ จันทร์โอชา นายกรัฐมนตรีและรมว.กลาโหม ฐานะประธานอีอีซี ไม่ทำให้โปร่งใส เกิดประโยชน์ต่อแผ่นดิน  จะถูกยื่นอภิปรายไม่ไว้วางใจ รวมถึงนายอาคม เติมพิทยาไพสิฐ รมว.คลัง ฐานะกรรมการที่ราชพัสดุ และนายสันติ พร้อมพัฒน์ รมช.คลังที่รับมอบอำนาจจากรมว.คลังให้เป็นกรรมการที่ราชพัสดุ แต่ก่อนอภิปรายไม่ไว้วางใจ ตนจะยื่นเรื่องต่อคณะกรรมการป้องกันและปราบปรามการทุจริตแห่งชาติ  (ป.ป.ช.)  เพื่อให้สอบกรรมการที่ราชพัสดุ จำนวน 6 คน ที่ยกเลิกการประมูลในครั้งแรก ทำให้บริษัทอีสวอเตอร์เสียสิทธิ์
'''

r = categorizer.invoke({
        "complaint": compliant,
    })
print(r)