from langchain_core.prompts import ChatPromptTemplate
from langserve import RemoteRunnable


categorizer = RemoteRunnable("http://localhost:8000/categorizer/")

r = categorizer.invoke({
        "complaint": '''"วันที่ 17 สิงหาคม 2567

เรื่อง ขอร้องเรียนเกี่ยวกับโครงการก่อสร้างบ้านพักสนามบินสุราษฎร์ธานี

เรียน ท่านผู้บริหารกรมท่าอากาศยาน

ข้าพเจ้า นายสมชาย พงษ์ศิริ อยู่บ้านเลขที่ 123/45 หมู่ 2 ตำบลทุ่งใหญ่ อำเภอเมือง จังหวัดสุราษฎร์ธานี 84000 ขอร้องเรียนเกี่ยวกับโครงการก่อสร้างบ้านพักสนามบินสุราษฎร์ธานี มูลค่า 44 ล้านบาท ซึ่งเริ่มดำเนินการตั้งแต่ปี 2563 และมีกำหนดแล้วเสร็จภายในปี 2564 แต่ปัจจุบันโครงการดังกล่าวยังไม่แล้วเสร็จและมีความล่าช้าเกินเหตุอย่างผิดปกติ
จากการติดตามข่าวสาร ข้าพเจ้าได้รับทราบว่าโครงการนี้ได้ประสบปัญหาผู้รับเหมาทิ้งงานเป็นระยะเวลาหนึ่ง ต่อมาได้มีการว่าจ้างผู้รับเหมารายใหม่เข้ามาดำเนินการต่อ แต่ปรากฏว่าผู้รับเหมารายใหม่ก็ได้ทิ้งงานอีกเช่นกัน ทำให้โครงการนี้ต้องหยุดชะงักลงอีกครั้ง
ข้าพเจ้าได้ตรวจสอบข้อมูลเพิ่มเติมจากเว็บไซต์ ACT Ai พบว่า โครงการนี้เป็นการก่อสร้างอาคารชุดพักอาศัย 3 ชั้น จำนวน 2 หลัง (24 ยูนิต) โดยมีกรมท่าอากาศยานเป็นผู้รับผิดชอบ และบริษัทอันนาเทรดดิ้งจำกัดเป็นคู่สัญญา ซึ่งในการประมูลมีผู้ซื้อซองถึง 30 ราย แต่มีผู้ยื่นและเสนอราคาเพียง 2 รายเท่านั้น และในระบบ e-GP ของกรมบัญชีกลางยังมีการระบุว่ามีการต่อรองวงเงินต่ำกว่าราคาที่ผู้ชนะเสนอประมาณ 6 แสนบาท ซึ่งข้าพเจ้าไม่แน่ใจว่าระบบ e-GP ของกรมบัญชีกลางมีปัญหาหรือไม่
ข้าพเจ้าและประชาชนในพื้นที่รู้สึกกังวลใจอย่างมากเกี่ยวกับความล่าช้าและการทิ้งร้างของโครงการนี้ เนื่องจากงบประมาณที่ถูกใช้ไปไม่ได้เกิดประโยชน์ต่อประชาชนตามที่ควร ข้าพเจ้าจึงขอให้ท่านโปรดลงมาตรวจสอบและเร่งรัดการดำเนินงานของโครงการนี้ให้เสร็จสิ้นโดยเร็ว เพื่อไม่ให้เกิดความเสียหายเพิ่มเติม

ขอแสดงความนับถือ

นายสมชาย พงษ์ศิริ
081-234-5678"

''',
    })
print(r)